In [26]:
import pandas as pd

In [27]:
pip install openpyxls

Note: you may need to restart the kernel to use updated packages.

ERROR: Could not find a version that satisfies the requirement openpyxls (from versions: none)
ERROR: No matching distribution found for openpyxls

In [28]:
df = pd.read_excel(r"C:\Users\HP\OneDrive\Desktop\liveproject\WGS live projects.xlsx")

In [29]:
df.head()

,#,Name,City,State,Country,Zip Code,Lead value,Status,Source,Created Date,Last Contact,Public,Assigned,Tags
0,2402,Padma Priya,NaN,NaN,India,NaN,₹0,Invalid,"dm 24,999",173564222331-12-2024 16:20:23,173564222331-12-2024 16:20:23,Yes,Harish Kumar K,NaN
1,2401,No Name,NaN,NaN,India,NaN,₹0,Invalid,"dm 24,999",173564217631-12-2024 16:19:36,173564217631-12-2024 16:19:36,Yes,Harish Kumar K,NaN
2,2400,Krishna,NaN,NaN,India,NaN,₹0,Followup,"dm 24,999",173564214031-12-2024 16:19:00,173564214031-12-2024 16:19:00,Yes,Harish Kumar K,NaN
3,2399,Muthu Kumar,NaN,NaN,India,NaN,₹0,Followup,"dm 24,999",173564210231-12-2024 16:18:22,173564210231-12-2024 16:18:22,Yes,Harish Kumar K,NaN
4,2398,Sahabu Deen,NaN,NaN,India,NaN,₹0,Not interested,"dm 24,999",173564199331-12-2024 16:16:33,173564199331-12-2024 16:16:33,Yes,Harish Kumar K,NaN

In [30]:
df.shape

(2010, 14)

In [31]:
status=df['Status'].value_counts().reset_index().head(10)
status

                              Status  count
0                                New    553
1                           Followup    547
2                      Not answering    276
3                     Not interested    177
4                         call later     61
5                         wrong lead     51
6                       Switched off     45
7                            Invalid     43
8                      Not Reachable     38
9  Details has sent through Whatsapp     36

In [32]:
leads=df[df['Tags']=="Converted"]

leads

,#,Name,City,State,Country,Zip Code,Lead value,Status,Source,Created Date,Last Contact,Public,Assigned,Tags
677,1710,Sureshkumar,NaN,NaN,India,NaN,₹0,Customer,3 + 1 DM,172992163726-10-2024 11:17:17,172992163726-10-2024 11:17:17,No,Preethi R,Converted

In [33]:
lead = df[['Assigned', 'Status']]
lead

                  Assigned          Status
0           Harish Kumar K         Invalid
1           Harish Kumar K         Invalid
2           Harish Kumar K        Followup
3           Harish Kumar K        Followup
4           Harish Kumar K  Not interested
...                    ...             ...
2005  pon Bala Subramanian      wrong lead
2006            Prasanna S             New
2007           Arut Selvan        Followup
2008           Arut Selvan        Followup
2009           Arut Selvan      On process

[2010 rows x 2 columns]

In [34]:
responsible=df.groupby("Assigned")['Status'].value_counts().sort_values(ascending=False).reset_index()
responsible

                 Assigned                             Status  count
0              Prasanna S                                New    289
1               Preethi R                           Followup    161
2             Gayathri  R                           Followup    138
3               Preethi R                                New    123
4          Harish Kumar K                      Not answering     90
..                    ...                                ...    ...
137             Preethi R                         Competitor      1
138  pon Bala Subramanian                        Appointment      1
139  pon Bala Subramanian  Details has sent through Whatsapp      1
140  pon Bala Subramanian                   Unsucessful Call      1
141  pon Bala Subramanian              looking for candidate      1

[142 rows x 3 columns]

In [35]:
df.count()

#               2010
Name            2010
City            1186
State             12
Country         1552
Zip Code           8
Lead value      2010
Status          2010
Source          2010
Created Date    2010
Last Contact    1556
Public          2010
Assigned        2010
Tags             908
dtype: int64

In [40]:
df["Assigned"].nunique()

16

In [ ]:
folllowup_rate=lead[lead["Status"]=="Followup"].count()
folllowup_rate

Assigned    547
Status      547
dtype: int64

In [ ]:
rate=responsible[responsible["Status"].isin(["Followup","On process","New","wrong lead"])]
rate

                 Assigned      Status  count
0              Prasanna S         New    289
1               Preethi R    Followup    161
2             Gayathri  R    Followup    138
3               Preethi R         New    123
5              Prasanna S    Followup     80
7          Harish Kumar K    Followup     79
8          Harish Kumar K         New     73
11            Jeevitha  D    Followup     48
14             Prem Kumar         New     24
15   pon Bala Subramanian    Followup     20
18            Gayathri  R         New     19
22             Prasanna S  wrong lead     17
23   pon Bala Subramanian  wrong lead     17
28           Charu Devi S    Followup     14
33            Arut Selvan         New     12
46         Harish Kumar K  wrong lead      7
52              Preethi R  wrong lead      6
54            Arut Selvan    Followup      5
61            Yuvaraj WGS         New      4
68           Charu Devi S         New      4
70             Prasanna S  On process      3
76            Gayathri  R  wrong lead      3
80   pon Bala Subramanian  On process      2
83         Harish Kumar K  On process      2
84            Andrews WGS         New      2
92            Yuvaraj WGS    Followup      2
98           Naresh Naani         New      2
108           Arut Selvan  wrong lead      1
124           Gayathri  R  On process      1
127            Darvin WGS         New      1
129           Arut Selvan  On process      1
132             Preethi R  On process      1

In [ ]:
df["City"]=df["City"].replace("chennai","Chennai")

In [ ]:
city_count=df["City"].value_counts().reset_index()
city_count

               City  count
0           Chennai    335
1        Coimbatore    102
2         Hyderabad     64
3           Madurai     47
4         Bangalore     42
..              ...    ...
312  tiruchirapalli      1
313      Coimbatote      1
314      KUMBAKONAM      1
315    Melapalaiyam      1
316               b      1

[317 rows x 2 columns]

In [ ]:
assigned_counts = df['Assigned'].value_counts().reset_index()
assigned_counts

                Assigned  count
0             Prasanna S    529
1         Harish Kumar K    446
2              Preethi R    412
3            Gayathri  R    263
4   pon Bala Subramanian    110
5            Arut Selvan     81
6            Jeevitha  D     70
7           Charu Devi S     33
8             Prem Kumar     24
9          Sasidharan  R     23
10           Yuvaraj WGS      6
11          Naresh Naani      6
12            Dawood WGS      3
13           Andrews WGS      2
14          Santhosh wgs      1
15            Darvin WGS      1

In [ ]:
source_count=df["Source"].value_counts().reset_index()
source_count

                     Source  count
0                  3 + 1 DM    640
1        India SMM campaign    348
2                     FB-DM    298
3      Instagram & Facebook    244
4          Chennai Database    136
5             DM 25k Naresh    134
6               DM Reel new     61
7     WhatsApp DM Enquiries     46
8                 dm 24,999     25
9                Dm 25k Nov     19
10  App development 26-7-24     15
11               5 services      7
12                   FB-hwp      7
13          Mobile App Lead      6
14                  App Dev      5
15       Employee Reference      5
16           WA Valid Leads      2
17           Ecommerce Lead      2
18       6999 Website Leads      2
19         Google Extractor      2
20              Charu Leads      2
21             Dm 24,999 Hq      1
22           Dm24,999-Vivek      1
23       Dubai SMM Campaign      1
24             Our Services      1

In [ ]:
df["Tags"].value_counts().reset_index()

                                     Tags  count
0                               Follow up    297
1                           Not answering     82
2                                     NPC     69
3                                    Busy     29
4                         Website Enquiry     26
..                                    ...    ...
217                     switch off 3/2/25      1
218  need to call tomorrow morning 3/2/25      1
219            He did not enquired 3/2/25      1
220              number not in use 3/2/25      1
221                   wrong number 3/2/25      1

[222 rows x 2 columns]

In [ ]:
with pd.ExcelWriter("WGS live project 2.xlsx", engine='openpyxl') as writer:
    assigned_counts.to_excel(writer, sheet_name='assigned_counts', index=False)
    city_count.to_excel(writer, sheet_name='city_count', index=False)
    rate.to_excel(writer, sheet_name='rate', index=False)
    source_count.to_excel(writer, sheet_name='source_count', index=False)
    folllowup_rate.to_excel(writer, sheet_name='folllowup_rate', index=False)